Revit 2026 API

# UVBasisV Property

---

The basis of the V axis.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV BasisV { get; }
```
```vb
Public Shared ReadOnly Property BasisV As UV
	Get
```
```cpp
public:
static property UV^ BasisV {
	UV^ get ();
}
```
```fsharp
static member BasisV : UV with get
```

#### Property Value

UV

The basis of the V axis is the vector (0,1), the unit vector on the V axis.

#### Reference

UV Class

Autodesk.Revit.DB Namespace